# StructuralAnalyticalColumnRigidLink Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAnalyticalColumnRigidLink Property
ParameterTypeId Class See Also
---
"Analytical Links"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalyticalColumnRigidLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalyticalColumnRigidLink As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalyticalColumnRigidLink {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace